; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v12)
             (pred_6 ?v2 ?v6)
             (pred_11 ?v1 ?v6)
             (pred_4 ?v10 ?v1 )
	     (pred_7 ?v1)
             (pred_12 ?v9)
             (pred_1 ?v2)
             (pred_5 ?v6)
             (pred_10 ?v1)
             (pred_8 ?v2)
             (pred_3 ?v1)
             (pred_9 ))



(:action op_5
:parameters (?v3 ?v8 ?v4 ?v13)
:precondition (and (pred_12 ?v3) (pred_12 ?v8) (pred_1 ?v4) (pred_5 ?v13)
          (pred_2 ?v3 ?v8) (pred_6 ?v4 ?v13)
                   (pred_11 ?v8 ?v13) (pred_7 ?v3) 
                   (pred_10 ?v8) (pred_8 ?v4))
:effect (and  (pred_3 ?v8) (not (pred_10 ?v8))))


(:action op_4
:parameters (?v3 ?v11)
:precondition (and (pred_12 ?v3) (pred_12 ?v11)
               (pred_7 ?v3) (pred_2 ?v3 ?v11) (pred_3 ?v11))
:effect (and (pred_7 ?v11) (not (pred_7 ?v3))))

(:action op_2
:parameters (?v3 ?v4)
:precondition (and (pred_12 ?v3) (pred_1 ?v4) 
                  (pred_7 ?v3) (pred_4 ?v4 ?v3) (pred_9 ))
:effect (and (pred_8 ?v4)
   (not (pred_4 ?v4 ?v3)) (not (pred_9 ))))


(:action op_1
:parameters (?v3 ?v5 ?v7)
:precondition (and (pred_12 ?v3) (pred_1 ?v5) (pred_1 ?v7)
                  (pred_7 ?v3) (pred_8 ?v7) (pred_4 ?v5 ?v3))
:effect (and (pred_8 ?v5) (pred_4 ?v7 ?v3)
        (not (pred_8 ?v7)) (not (pred_4 ?v5 ?v3))))

(:action op_3
:parameters (?v3 ?v4)
:precondition (and (pred_12 ?v3) (pred_1 ?v4) 
                  (pred_7 ?v3) (pred_8 ?v4))
:effect (and (pred_9 ) (pred_4 ?v4 ?v3) (not (pred_8 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_18 obj_20 obj_11 obj_10 obj_17 obj_02 obj_04 obj_21 obj_03 obj_22 obj_30 obj_01 obj_05 obj_24 obj_06 obj_13 obj_07 obj_08 obj_09 obj_23 obj_26 obj_29 obj_25 obj_14
    obj_28 obj_12
    obj_27 obj_19 obj_15
    )

    (:init
       (pred_9)

       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_04)
       (pred_12 obj_21)
       (pred_12 obj_03)
       (pred_12 obj_22)
       (pred_12 obj_30)
       (pred_12 obj_01)
       (pred_12 obj_05)
       (pred_12 obj_24)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_07)
       (pred_12 obj_08)
       (pred_12 obj_09)
       (pred_12 obj_23)
       (pred_12 obj_26)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_12 obj_14)
       (pred_5 obj_28)
       (pred_5 obj_12)
       (pred_1 obj_27)
       (pred_1 obj_19)
       (pred_1 obj_15)

       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_02 obj_30)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_21)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_04)
       (pred_2 obj_03 obj_24)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_22 obj_30)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_30 obj_13)
       (pred_2 obj_30 obj_01)
       (pred_2 obj_30 obj_02)
       (pred_2 obj_30 obj_22)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_01 obj_05)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_01 obj_30)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_05 obj_24)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_01)
       (pred_2 obj_24 obj_09)
       (pred_2 obj_24 obj_03)
       (pred_2 obj_24 obj_05)
       (pred_2 obj_06 obj_23)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_13 obj_26)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_13 obj_30)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_07 obj_29)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_08 obj_25)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_24)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_23 obj_26)
       (pred_2 obj_23 obj_06)
       (pred_2 obj_26 obj_29)
       (pred_2 obj_26 obj_13)
       (pred_2 obj_26 obj_23)
       (pred_2 obj_29 obj_25)
       (pred_2 obj_29 obj_07)
       (pred_2 obj_29 obj_26)
       (pred_2 obj_25 obj_14)
       (pred_2 obj_25 obj_08)
       (pred_2 obj_25 obj_29)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_25)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_25)
       (pred_11  obj_08 obj_28)
       (pred_11  obj_06 obj_12)
       (pred_11  obj_25 obj_28)
       (pred_3 obj_16)
       (pred_3 obj_18)
       (pred_3 obj_20)
       (pred_3 obj_11)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_21)
       (pred_3 obj_03)
       (pred_3 obj_22)
       (pred_3 obj_30)
       (pred_3 obj_01)
       (pred_3 obj_05)
       (pred_3 obj_24)
       (pred_3 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_09)
       (pred_3 obj_23)
       (pred_3 obj_26)
       (pred_3 obj_29)
       (pred_3 obj_14)

       (pred_6  obj_27 obj_28)
       (pred_6  obj_19 obj_12)
       (pred_6  obj_15 obj_28)
       (pred_4 obj_27 obj_20)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_15 obj_09)
       (pred_7 obj_10)
    )

    (:goal (and
       (pred_4 obj_27 obj_11)
       (pred_4 obj_15 obj_21)
    ))
(:constraints
  (always (not (pred_7 obj_03)))
)
)

; plan
1. (op_4 obj_10 obj_11)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_11)
   goals met: 0 of 2
2. (op_4 obj_11 obj_20)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_20)
   goals met: 0 of 2
3. (op_2 obj_20 obj_27)
   deleted: (pred_4 obj_27 obj_20) (pred_9)
   added: (pred_8 obj_27)
   goals met: 0 of 2
4. (op_4 obj_20 obj_11)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_11)
   goals met: 0 of 2
5. (op_3 obj_11 obj_27)
   deleted: (pred_8 obj_27)
   added: (pred_9) (pred_4 obj_27 obj_11)
   goals met: 1 of 2
6. (op_4 obj_11 obj_21)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_21)
   goals met: 1 of 2
7. (op_4 obj_21 obj_05)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_05)
   goals met: 1 of 2
8. (op_4 obj_05 obj_24)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_24)
   goals met: 1 of 2
9. (op_4 obj_24 obj_09)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_09)
   goals met: 1 of 2
10. (op_2 obj_09 obj_15)
   deleted: (pred_4 obj_15 obj_09) (pred_9)
   added: (pred_8 obj_15)
   goals met: 1 of 2
11. (op_4 obj_09 obj_24)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_24)
   goals met: 1 of 2
12. (op_4 obj_24 obj_05)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_05)
   goals met: 1 of 2
13. (op_4 obj_05 obj_21)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_21)
   goals met: 1 of 2
14. (op_3 obj_21 obj_15)
   deleted: (pred_8 obj_15)
   added: (pred_9) (pred_4 obj_15 obj_21)
   goals met: 2 of 2
